Revit 2027 API
RebarShapeDefinitionByArc.AddConstraintChordLength Method
 Specify a parameter to drive the chord length (the straight-line distance between the endpoints of the arc).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddConstraintChordLength(
	ElementId paramId
)
Public Sub AddConstraintChordLength (
	paramId As ElementId
)
public:
void AddConstraintChordLength(
	ElementId^ paramId
)
member AddConstraintChordLength :
        paramId : ElementId -> unit
Parameters
paramId ElementId
 Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The chord length is measured on the centerline of the bar.
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace